<a href="https://colab.research.google.com/github/MarshRangel/MyProjPython/blob/master/DataframePandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [6]:
## Ejemplo de tabla

# |  Nombre  |  Edad  | Altura  |     |     |
# |  ---     |  ---   | ---     | --- | --- |
# |  Marsh   |   45   | 1.66    |     |     |
# |  May     |   22   | 1.78    |     |     |
# |  Yaya    |   49   | 1.58    |     |     |

In [4]:
import pandas as pd

In [7]:
# @title Dataframe desde archivo CSV
df1 = pd.read_csv("lista_personas.csv")

In [8]:
df1

  Nombre  Edad  Altura
0  Marsh    45    1.66
1    May    22    1.78
2   Yaya    49    1.58

In [11]:
# @title Dataframe - Agregando datos desde un diccionario de Python
diccionario = [{'Nombre':"Marsh","Edad":45,"Altura":1.66},
               {'Nombre':"May","Edad":22,"Altura":1.78},
               {'Nombre':"Yaya","Edad":49,"Altura":1.58}]

In [12]:
df2 = pd.DataFrame(diccionario)
df2

  Nombre  Edad  Altura
0  Marsh    45    1.66
1    May    22    1.78
2   Yaya    49    1.58

In [15]:
listaDeListas = [
                 ["Marsh",45,1.66],
                 ["May",22,1.78],
                 ["Yaya",49,1.58]
                ]
#df3 = pd.DataFrame(listaDeListas, columns=["Nombre","Edad","Altura"])
df3 = pd.DataFrame(listaDeListas)
df3

       0   1     2
0  Marsh  45  1.66
1    May  22  1.78
2   Yaya  49  1.58

In [17]:
df4 = pd.DataFrame()
df4["Nombre"] = ["Marsh","May","Yaya"]
df4["Edad"] = [45,22,49]
df4["Altura"] = [1.66,1.78,1.58]
df4

  Nombre  Edad  Altura
0  Marsh    45    1.66
1    May    22    1.78
2   Yaya    49    1.58

In [20]:
df = pd.read_csv("datos_personas.csv")

In [21]:
df

    Nombre    Apellido  Edad  Peso  Altura
0  Roberto      Alfaro    16    70    1.78
1    Laura  Bustamante    15    57    1.60
2    Erick     Estrada    16    65    1.74
3    Maria   Domínguez    15    52    1.60
4    Jorge       Ortíz    17    60    1.70
5     Rosa     Jiménez    16    56    1.53

In [23]:
df.head(2)

    Nombre    Apellido  Edad  Peso  Altura
0  Roberto      Alfaro    16    70    1.78
1    Laura  Bustamante    15    57    1.60

In [24]:
df.tail(2)

  Nombre Apellido  Edad  Peso  Altura
4  Jorge    Ortíz    17    60    1.70
5   Rosa  Jiménez    16    56    1.53

In [27]:
df.sample()

  Nombre   Apellido  Edad  Peso  Altura
3  Maria  Domínguez    15    52     1.6

In [30]:
df

    Nombre    Apellido  Edad  Peso  Altura
0  Roberto      Alfaro    16    70    1.78
1    Laura  Bustamante    15    57    1.60
2    Erick     Estrada    16    65    1.74
3    Maria   Domínguez    15    52    1.60
4    Jorge       Ortíz    17    60    1.70
5     Rosa     Jiménez    16    56    1.53

In [31]:
df.describe()

            Edad       Peso    Altura
count   6.000000   6.000000  6.000000
mean   15.833333  60.000000  1.658333
std     0.752773   6.542171  0.096419
min    15.000000  52.000000  1.530000
25%    15.250000  56.250000  1.600000
50%    16.000000  58.500000  1.650000
75%    16.000000  63.750000  1.730000
max    17.000000  70.000000  1.780000

In [34]:
# Series de Datos: 
df["Edad"]

0    16
1    15
2    16
3    15
4    17
5    16
Name: Edad, dtype: int64

In [35]:
df.Edad

0    16
1    15
2    16
3    15
4    17
5    16
Name: Edad, dtype: int64

In [36]:
df[["Edad"]]

   Edad
0    16
1    15
2    16
3    15
4    17
5    16

In [37]:
df[["Edad","Altura"]]

   Edad  Altura
0    16    1.78
1    15    1.60
2    16    1.74
3    15    1.60
4    17    1.70
5    16    1.53

In [38]:
df[["Edad","Altura","Nombre"]]

   Edad  Altura   Nombre
0    16    1.78  Roberto
1    15    1.60    Laura
2    16    1.74    Erick
3    15    1.60    Maria
4    17    1.70    Jorge
5    16    1.53     Rosa

In [41]:
df["Nombre_Completo"] = df["Nombre"]+" "+df["Apellido"]
df

    Nombre    Apellido  Edad  Peso  Altura   Nombre_Completo
0  Roberto      Alfaro    16    70    1.78    Roberto Alfaro
1    Laura  Bustamante    15    57    1.60  Laura Bustamante
2    Erick     Estrada    16    65    1.74     Erick Estrada
3    Maria   Domínguez    15    52    1.60   Maria Domínguez
4    Jorge       Ortíz    17    60    1.70       Jorge Ortíz
5     Rosa     Jiménez    16    56    1.53      Rosa Jiménez

In [43]:
df["Nombre_Completo"] = df["Nombre"]+" "+df["Apellido"]
df["imc"] = df["Peso"]/df["Altura"] * df["Altura"]
df

    Nombre    Apellido  Edad  Peso  Altura   Nombre_Completo   imc
0  Roberto      Alfaro    16    70    1.78    Roberto Alfaro  70.0
1    Laura  Bustamante    15    57    1.60  Laura Bustamante  57.0
2    Erick     Estrada    16    65    1.74     Erick Estrada  65.0
3    Maria   Domínguez    15    52    1.60   Maria Domínguez  52.0
4    Jorge       Ortíz    17    60    1.70       Jorge Ortíz  60.0
5     Rosa     Jiménez    16    56    1.53      Rosa Jiménez  56.0

In [45]:
df["Edad"]>=16

0     True
1    False
2     True
3    False
4     True
5     True
Name: Edad, dtype: bool

In [47]:
#Para pandas se usa & y |, en vez de and y or como los usa Python
df[(df["Edad"]>=16) & (df["Altura"]>1.60)]

    Nombre Apellido  Edad  Peso  Altura Nombre_Completo   imc
0  Roberto   Alfaro    16    70    1.78  Roberto Alfaro  70.0
2    Erick  Estrada    16    65    1.74   Erick Estrada  65.0
4    Jorge    Ortíz    17    60    1.70     Jorge Ortíz  60.0

In [48]:
df.groupby('Edad').size()

Edad
15    2
16    3
17    1
dtype: int64